app/views/bookings/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<!-- here -->
        <% unless current_user.groups.find_by(booking: @booking) || @booking.full? || current_user == @booking.user %>